# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые
# встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества.
# m — кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.


# n = int(input("Введите кол-во элементов первого множества: "))
# m = int(input("Введите кол-во элементов второго множества: "))

# n_set = set()
# for i in range(n):
#     n_set.add(int(input("Введите числа для первого множества: ")))
# m_set = set()
# for i in range(m):
#     m_set.add(int(input("Введите числа для второго множества: "))) 
# print(n_set)  
# print(m_set)
# print(sorted(n_set.intersection(m_set)))     